export const loadOne = () => ({
  name: "秋词",
  poet: "刘禹锡",
  poem: [
    "好雨知时节,当春乃发生",
    "随风潜入夜,润物细无声",
    "野径云俱黑,江船火独明",
    "晓看红湿处,花重锦官城",
  ],
});

// two = {
//   name: "杜甫",
//   poet: "春夜喜雨",
//   poem: ["自古逢秋悲寂寥,我言秋日胜春朝", "晴空一鹤排云上,便引诗情到碧霄"],
// };

// thee = {
//   name: "赋得古原草送别",
//   poet: "白居易",
//   poem: [
//     "离离原上草, 一岁一枯荣",
//     "野火烧不尽, 春风吹又生",
//     "远芳侵古道, 晴翠接荒城",
//     "又送王孙去, 萋萋满别情",
//   ],
// };

// four = {
//   name: "登高",
//   poet: "杜甫",
//   poem: [
//     "风急天高猿啸哀,渚清沙白鸟飞回",
//     "无边落木萧萧下,不尽长江滚滚来",
//     "万里悲秋常作客,百年多病独登台",
//     "艰难苦恨繁霜鬓,潦倒新停浊酒杯",
//   ],
// };

// five = {
//   name: "送杜少府之任蜀州",
//   poet: "王勃",
//   poem: [
//     "城阙辅三秦,风烟望五津",
//     "与君离别意,同是宦游人",
//     "海内存知己,天涯若比邻",
//     "无为在歧路,儿女共沾巾",
//   ],
// };

// six = {
//   name: "黄鹤楼",
//   poet: "崔颢",
//   poem: [
//     "昔人已乘黄鹤去,此地空余黄鹤楼",

//     "黄鹤一去不复返,白云千载空悠悠",

//     "晴川历历汉阳树,芳草萋萋鹦鹉洲",

//     "日暮乡关何处是,烟波江上使人愁",
//   ],
// };

// seven = {
//   name: "春晓",
//   poet: "孟浩然",
//   poem: ["春眠不觉晓,处处闻啼鸟", "夜来风雨声,花落知多少"],
// };

// eight = {
//   name: "登鹳雀楼",
//   poet: "王之涣",
//   poem: ["白日依山尽,黄河入海流", "欲穷千里目,更上一层楼"],
// };

// nine = {
//   name: "江雪",
//   poet: "柳宗元",
//   poem: ["千山鸟飞绝,万径人踪灭", "孤舟蓑笠翁,独钓寒江雪"],
// };

// ten = {
//   name: "静夜思",
//   poet: "李白",
//   poem: ["床前明月光,疑是地上霜", "举头望明月,低头思故乡"],
// };

// eleven = {
//   name: "竹里馆",
//   poet: "王维",
//   poem: ["独坐幽篁里,弹琴复长啸", "深林人不知,明月来相照"],
// };

// twelve = {
//   name: "将进酒",
//   poet: "李白",
//   poem: [
//     "人生得意须尽欢,莫使金樽空对月",
//     "天生我材必有用,千金散尽还复来",
//   ],
// };

// export const poem_data = () => [
//   one,
//   two,
//   three,
//   four,
//   five,
//   six,
//   sevem,
//   eight,
//   nine,
//   ten,
//   eleven,
//   twelve,
// ]
